tutorials/CYCLIC/0/init/internalT
internalField uniform 273.15;  
/*
internalField nonuniform List<scalar> 
12288                                    
{                                     
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
350
273.15
...
273.15                                    
}                                     
;
*/