tutorials/CYCLIC/0/init/internalp
internalField   uniform 101325;
/*
internalField nonuniform List<scalar>
865
{

}
*/