tutorials/CYCLIC/0/rho_TALE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho_TALE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0.0153761;

boundaryField
{
    inlet
    {
        type            cyclic;
        value           uniform 0.0153761;
    }
    outlet
    {
        type            cyclic;
        value           uniform 0.0153761;
    }
    top
    {
        type            cyclic;
        value           uniform 0.0153761;
    }
    bottom
    {
        type            cyclic;
        value           uniform 0.0153761;
    }
    left
    {
        type            cyclic;
        value           uniform 0.0153761;
    }
    right
    {
        type            cyclic;
        value           uniform 0.0153761;
    }
}


// ************************************************************************* //
