tutorials/CYCLIC/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-10    -7.5 0)      //0
    ( 10    -7.5 0)      //1
    ( 10     7.5 0)      //2
    (-10     7.5 0)      //3
    (-10    -7.5 1)      //4
    ( 10    -7.5 1)      //5
    ( 10     7.5 1)      //6
    (-10     7.5 1)      //7
);

blocks
(
    // inlet block
    hex (0 1 2 3  4 5 6 7) (50 50 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type cyclic;
	neighbourPatch outlet;
        faces ((0 4 7 3));
	transform translational;
	separationVector (20 0 0);
    }

    outlet
    {
        type cyclic;
	neighbourPatch inlet;
        faces ((1 5 6 2));
	transform translational;
	separationVector (-20 0 0);
    }

    top
    {
      type cyclic;
      neighbourPatch bottom;
      faces ((6 7 3 2));
      transform translational;
      separationVector (0 -15 0);
    }

    bottom 
    {
      type cyclic;
      neighbourPatch top;
      faces ((5 4 0 1));
      transform translational;
      separationVector (0 15 0);
    }    

    left
    {
      type cyclic;
      neighbourPatch right;
      faces ((3 2 1 0));
      transform translational;
      separationVector (0 0 1);
    }

    right 
    {
      type cyclic;
      neighbourPatch left;
      faces ((7 6 5 4));
      transform translational;
      separationVector (0 0 1);
    }    
);


// ************************************************************************* //
